{
  "metadata": {
    "name": "getting-started"
  },
  "spec": {
    "displayName": "Getting Started with {product-long}",
    "durationMinutes": 10,
    "icon": "",
    "description": "Learn how to create and set up your first Apache Kafka instance in {product-long}.",
    "prerequisites": [
      "A Red Hat identity",
      "Access to the Red Hat OpenShift Streams for Apache Kafka environment at https://cloud.redhat.com"
    ],
    "introduction": "Welcome to the {product-long} Getting Started quick start. In this quick start, you’ll learn how to create and inspect a Kafka instance, create a service account to connect an application or service to the instance, and create a topic in the instance.",
    "tasks": [
      {
        "title": "Creating a Kafka instance in bf2",
        "description": "<div class=\"paragraph\">\n<p>A Kafka instance in {product} includes a Kafka cluster, bootstrap server, and other required configurations for connecting to Kafka producer and consumer services. You can use the {product} web console to create and configure a Kafka instance for your applications or services.</p>\n</div>\n<div class=\"olist arabic\">\n<div class=\"title\">Procedure</div>\n<ol class=\"arabic\">\n<li>\n<p>In the <strong>Streams for Apache Kafka</strong> page of the web console, click <strong>Create Kafka instance</strong> and define the following instance details. Some values currently have only one option.</p>\n<div class=\"ulist\">\n<ul>\n<li>\n<p><strong>Instance name</strong>: Enter a unique hyphenated name for the instance, such as <code>my-first-kafka-instance</code> in this example.</p>\n</li>\n<li>\n<p><strong>Cloud provider</strong>: Select <code>Amazon Web Services</code>.</p>\n</li>\n<li>\n<p><strong>Cloud region</strong>: Select <code>US East, N. Virginia</code>.</p>\n</li>\n<li>\n<p><strong>Availability zones</strong>: Select <code>Multi</code>.</p>\n</li>\n</ul>\n</div>\n</li>\n<li>\n<p>Click <strong>Create instance</strong> to start the creation process for your Kafka instance.</p>\n<div class=\"openblock\">\n<div class=\"content\">\n<div class=\"imageblock screencapture\">\n<div class=\"content\">\n<img src=\"sak-configure-kafka-instance.png\" alt=\"Image of instance configuration details in Create Kafka instance window\">\n</div>\n<div class=\"title\">Figure 1. Kafka instance configuration details</div>\n</div>\n<div class=\"paragraph\">\n<p>The new Kafka instance is listed in the instances table. When the instance <strong>Status</strong> becomes <strong>Ready</strong>, you can start using the Kafka instance.</p>\n</div>\n<div class=\"imageblock screencapture\">\n<div class=\"content\">\n<img src=\"sak-kafka-instance-ready.png\" alt=\"Image of new Kafka instance in Ready state\">\n</div>\n<div class=\"title\">Figure 2. New Kafka instance in Ready state</div>\n</div>\n</div>\n</div>\n</li>\n<li>\n<p>In the instances table, on the right side of the Kafka instance, use the options icon (three vertical dots) to view the instance details, connect to the instance, or delete the instance as needed.</p>\n<div class=\"imageblock screencapture\">\n<div class=\"content\">\n<img src=\"sak-kafka-instance-options.png\" alt=\"Image of Kafka instance options menu\">\n</div>\n<div class=\"title\">Figure 3. Kafka instance options menu</div>\n</div>\n</li>\n</ol>\n</div>\n<div class=\"ulist\">\n<div class=\"title\">Verification</div>\n<ul>\n<li>\n<p>Is the new Kafka instance listed in the instances table?</p>\n</li>\n<li>\n<p>Is the state of the new Kafka instance shown as <strong>Ready</strong>?</p>\n</li>\n</ul>\n</div>"
      },
      {
        "title": "Creating a service account to connect to a Kafka instance in bf2",
        "description": "<div class=\"paragraph\">\n<p>To connect your applications or services to a Kafka instance in the {product} web console, you must create a service account, copy and save the generated credentials, and copy and save the bootstrap server location. {product-long} uses the SASL/OAUTHBEARER authentication mechanism over TLS to provide secure connections between your applications and Kafka instances. SASL/PLAIN authentication is also available for tools and libraries that do not support SASL/OAUTHBEARER, but SASL/OAUTHBEARER is recommended whenever possible. When you generate credentials for a Kafka instance, {product} creates a service account that contains the generated user name and password associated with the instance.</p>\n</div>\n<div class=\"ulist\">\n<div class=\"title\">Prerequisites</div>\n<ul>\n<li>\n<p>You have created a Kafka instance in the {product} web console and the instance is in <strong>Ready</strong> state.</p>\n</li>\n</ul>\n</div>\n<div class=\"olist arabic\">\n<div class=\"title\">Procedure</div>\n<ol class=\"arabic\">\n<li>\n<p>In the <strong>Streams for Apache Kafka</strong> page of the web console, on the right side of the relevant Kafka instance, select the options icon (three vertical dots) and click <strong>Connect to instance</strong>.</p>\n</li>\n<li>\n<p>In the <strong>Connection</strong> page, copy the <strong>External server</strong> endpoint to a secure location. This is the bootstrap server endpoint that your application requires to connect to the Kafka instance.</p>\n</li>\n<li>\n<p>Click <strong>Generate service account</strong> and copy the <strong>Client ID</strong> and <strong>Client secret</strong> to a secure location. Your application requires these credentials to authenticate the connection to the Kafka instance.</p>\n<div class=\"admonitionblock important\">\n<table>\n<tbody><tr>\n<td class=\"icon\">\n<div class=\"title\">Important</div>\n</td>\n<td class=\"content\">\nThe generated credentials are displayed only one time, so ensure that you have successfully and securely saved the copied credentials before closing the credentials window.\n</td>\n</tr>\n</tbody></table>\n</div>\n</li>\n<li>\n<p>After you save the generated credentials to a secure location, select the confirmation check box in the credentials window and close the window.</p>\n<div class=\"paragraph\">\n<p>You’ll use the server and client information that you saved to configure your application to connect to your Kafka instances when you’re ready. For example, if you plan to use <a href=\"https://github.com/edenhill/kafkacat\">Kafkacat</a> to interact with your Kafka instance, you’ll use this information to set your bootstrap server and client environment variables.</p>\n</div>\n</li>\n</ol>\n</div>\n<div class=\"ulist\">\n<div class=\"title\">Verification</div>\n<ul>\n<li>\n<p>Did you save the bootstrap server endpoint to a secure location?</p>\n</li>\n<li>\n<p>Did you save the client credentials to a secure location?</p>\n</li>\n</ul>\n</div>"
      },
      {
        "title": "Creating a Kafka topic in bf2",
        "description": "<div class=\"paragraph\">\n<p>After you create a Kafka instance, you can create Kafka topics to start producing and consuming messages in your services.</p>\n</div>\n<div class=\"ulist\">\n<div class=\"title\">Prerequisites</div>\n<ul>\n<li>\n<p>You have created a Kafka instance in the {product} web console and the instance is in <strong>Ready</strong> state.</p>\n</li>\n</ul>\n</div>\n<div class=\"olist arabic\">\n<div class=\"title\">Procedure</div>\n<ol class=\"arabic\">\n<li>\n<p>In the <strong>Streams for Apache Kafka</strong> page of the web console, select the name of the Kafka instance that you want to add a topic to.</p>\n</li>\n<li>\n<p>Click <strong>Create topic</strong> and follow the guided steps to define the topic details. Click <strong>Next</strong> to complete each step and click <strong>Finish</strong> to complete the setup.</p>\n<div class=\"openblock\">\n<div class=\"content\">\n<div class=\"imageblock screencapture\">\n<div class=\"content\">\n<img src=\"sak-create-topic.png\" alt=\"Image of wizard to create a topic\">\n</div>\n<div class=\"title\">Figure 4. Guided steps to define topic details</div>\n</div>\n<div class=\"ulist\">\n<ul>\n<li>\n<p><strong>Topic name</strong>: Enter a unique hyphenated topic name, such as <code>my-first-kafka-topic</code> in this example.</p>\n</li>\n<li>\n<p><strong>Partitions</strong>: Set the number of partitions for this topic. This example sets the partition to <code>1</code> for a single partition. Partitions are distinct lists of messages within a topic and enable parts of a topic to be distributed over multiple brokers in the cluster. A topic can contain one or more partitions, enabling producer and consumer loads to be scaled.</p>\n<div class=\"admonitionblock note\">\n<table>\n<tbody><tr>\n<td class=\"icon\">\n<div class=\"title\">Note</div>\n</td>\n<td class=\"content\">\nYou can increase the number of partitions later, but you cannot decrease them.\n</td>\n</tr>\n</tbody></table>\n</div>\n</li>\n<li>\n<p><strong>Message retention</strong>: Set the message retention time to the relevant value and increment. This example sets the retention to <code>7 days</code>. Message retention time is the amount of time that messages are retained in a topic before they are deleted or compacted, depending on the cleanup policy.</p>\n</li>\n<li>\n<p><strong>Replicas</strong>: Set the number of partition replicas for the topic and the minimum number of follower replicas that must be in sync with a partition leader. This example sets the replica factor and in-sync replicas to <code>1</code>. Replicas are copies of partitions in a topic. Partition replicas are distributed over multiple brokers in the cluster to ensure topic availability if a broker fails. When a follower replica is in sync with a partition leader, the follower replica can become the new partition leader if needed.</p>\n</li>\n</ul>\n</div>\n<div class=\"paragraph\">\n<p>After you complete the topic setup, the new Kafka topic is listed in the topics table. You can now start producing and consuming messages to and from this topic using services that you connect to this instance.</p>\n</div>\n</div>\n</div>\n</li>\n<li>\n<p>In the topics table, on the right side of the Kafka topic, use the options icon (three vertical dots) to edit or delete the topic as needed.</p>\n</li>\n</ol>\n</div>\n<div class=\"imageblock screencapture\">\n<div class=\"content\">\n<img src=\"sak-edit-topic.png\" alt=\"Image of topic options to edit or delete\">\n</div>\n<div class=\"title\">Figure 5. Edit or delete Kafka topic</div>\n</div>\n<div class=\"ulist\">\n<div class=\"title\">Verification</div>\n<ul>\n<li>\n<p>Is the new Kafka topic listed in the topics table?</p>\n</li>\n</ul>\n</div>"
      }
    ],
    "conclusion": "Congratulations! You successfully completed the {product} Getting Started quick start, and are now ready to use the service."
  }
}