{
  "metadata": {
    "name": "quarkus"
  },
  "spec": {
    "displayName": "<p>Using Quarkus applications with Kafka instances in {product-long}</p>",
    "durationMinutes": 10,
    "icon": "",
    "description": "<p>Learn how to use Quarkus applications to produce messages to and consume messages from a Kafka instance in {product-long}.</p>",
    "prerequisites": [
      "<p>A running Kafka instance (see the Getting Started quick start)</p>",
      "<p>A command-line terminal application</p>",
      "<p>Git</p>",
      "<p>An IDE</p>",
      "<p>JDK 11 or later</p>",
      "<p>Apache Maven 3.6.2 or later</p>"
    ],
    "introduction": "<p>Welcome to the {product-long} Quarkus quick start. In this quick start, you’ll learn how to use <a href=\"https://quarkus.io/\">Quarkus</a> to produce messages to and consume messages from your Kafka instances in {product-long}.</p>",
    "tasks": [
      {
        "title": "<p>Importing the Quarkus sample code</p>",
        "description": "<div>\n<p>For this quick start, you’ll use the Quarkus sample code from the {product} <a href=\"https://github.com/bf2fc6cc711aee1a0c2a/guides\">Guides and Samples</a> repository in GitHub. After you understand the concepts and tasks in this quick start, you can use your own Quarkus applications with {product} in the same way.</p>\n</div>\n<div>\n<div>Procedure</div>\n<ol>\n<li>\n<p>On the command line, clone the {product} <a href=\"https://github.com/bf2fc6cc711aee1a0c2a/guides\">Guides and Samples</a> repository from GitHub.</p>\n<div>\n<div>Cloning the guides and samples repository</div>\n<div>\n<pre><code>$ mkdir guides &#x26;&#x26; git clone {samples-git-repo}</code></pre>\n</div>\n</div>\n</li>\n<li>\n<p>In your IDE, import the <code>guides/quarkus</code> directory from the repository that you cloned.</p>\n</li>\n</ol>\n</div>\n<div>\n<div>Verification</div>\n<ul>\n<li>\n<p>Is the Quarkus example application imported into your IDE?</p>\n</li>\n</ul>\n</div>"
      },
      {
        "title": "<p>Configuring the Quarkus example application to connect to a Kafka instance</p>",
        "description": "<div>\n<p>To enable your Quarkus application to access a Kafka instance, you must configure the connection using the bootstrap server endpoint and the generated credentials for your {product} service account. For Quarkus, you can configure connection information by using the <code>application.properties</code> configuration file. This example sets environment variables and then references them in the  <code>application.properties</code> file.</p>\n</div>\n<div>\n<p>Quarkus applications use <a href=\"https://github.com/eclipse/microprofile-reactive-messaging\">MicroProfile Reactive Messaging</a> to produce messages to and consume messages from your Kafka instances in {product}. For more information about Quarkus configuration options for Kafka and Reactive Messaging, see <a href=\"https://quarkus.io/guides/kafka\">Using Apache Kafka with Reactive Messaging</a> in the Quarkus documentation.</p>\n</div>\n<div>\n<div>Prerequisites</div>\n<ul>\n<li>\n<p>You have the bootstrap server endpoint (external server endpoint) and the generated credentials for your service account. You retrieved this information previously for the Kafka instance in {product} by selecting the options menu (three vertical dots), clicking <strong>Connect to instance</strong>, and generating the service account.</p>\n</li>\n</ul>\n</div>\n<div>\n<div>Procedure</div>\n<ol>\n<li>\n<p>On the command line, enter the following commands to set the Kafka instance bootstrap server and client credentials as environment variables to be used by Quarkus or other applications. Replace the values with your own server and credential information.</p>\n<div>\n<div>Setting environment variables for server and credentials</div>\n<div>\n<pre><code>export BOOTSTRAP_SERVER=<em>&#x3C;bootstrap_server></em>\nexport CLIENT_ID=<em>&#x3C;client_id></em>\nexport CLIENT_SECRET=<em>&#x3C;client_secret></em>\nexport OAUTH_TOKEN_ENDPOINT_URI=<em>&#x3C;oauth_token_endpoint_uri></em></code></pre>\n</div>\n</div>\n</li>\n<li>\n<p>In the Quarkus example application, review the <code>src/main/resources/application.properties</code> file to understand how the environment variables you set in the previous step are used in your application.</p>\n</li>\n</ol>\n</div>\n<div>\n<div>Verification</div>\n<ul>\n<li>\n<p>Did you set environment variables for the Kafka instance?</p>\n</li>\n</ul>\n</div>"
      },
      {
        "title": "<p>Creating the <code>prices</code> Kafka topic in bf2</p>",
        "description": "<div>\n<p>For this quick start, the Kafka topic that the Quarkus example application references is called <code>prices</code>. You need to create this topic in {product} so that the Quarkus application can interact with it.</p>\n</div>\n<div>\n<div>Prerequisites</div>\n<ul>\n<li>\n<p>You have created a Kafka instance in {product} and the instance is in <strong>Ready</strong> state.</p>\n</li>\n</ul>\n</div>\n<div>\n<div>Procedure</div>\n<ol>\n<li>\n<p>In the <strong>Streams for Apache Kafka</strong> page of the web console, select the name of the Kafka instance that you want to add a topic to.</p>\n</li>\n<li>\n<p>Click <strong>Create topic</strong> and follow the guided steps to define the topic details. Click <strong>Next</strong> to complete each step and click <strong>Finish</strong> to complete the setup.</p>\n<div>\n<div>\n<img src=\"sak-create-topic.png\" alt=\"Image of wizard to create a topic\">\n</div>\n<div>Figure 1. Guided steps to define topic details</div>\n</div>\n<div>\n<ul>\n<li>\n<p><strong>Topic name</strong>: Enter <code>prices</code> as the topic name.</p>\n</li>\n<li>\n<p><strong>Partitions</strong>: Set the number of partitions for this topic. This example sets the partition to <code>1</code> for a single partition. Partitions are distinct lists of messages within a topic and enable parts of a topic to be distributed over multiple brokers in the cluster. A topic can contain one or more partitions, enabling producer and consumer loads to be scaled.</p>\n<div>\n<table>\n<tbody><tr>\n<td>\n<div>Note</div>\n</td>\n<td>\nYou can increase the number of partitions later, but you cannot decrease them.\n</td>\n</tr>\n</tbody></table>\n</div>\n</li>\n<li>\n<p><strong>Message retention</strong>: Set the message retention time to the relevant value and increment. This example sets the retention to <code>7 days</code>. Message retention time is the amount of time that messages are retained in a topic before they are deleted or compacted, depending on the cleanup policy.</p>\n<div>\n<p>After you complete the topic setup, the new Kafka topic is listed in the topics table. You can now run the Quarkus application to start producing and consuming messages to and from this topic.</p>\n</div>\n</li>\n</ul>\n</div>\n</li>\n</ol>\n</div>\n<div>\n<div>Verification</div>\n<ul>\n<li>\n<p>Is the new Kafka topic <code>prices</code> listed in the topics table?</p>\n</li>\n</ul>\n</div>"
      },
      {
        "title": "<p>Running the Quarkus example application</p>",
        "description": "<div>\n<p>After you configure your Quarkus application to connect to a Kafka instance and you create the Kafkat topic, you can run the Quarkus application to start producing and consuming messages to and from the topic. The Quarkus example application in this quick start has three application-scoped beans: one generates a random number between 0 and 100 and produces it to a Kafka topic, another bean consumes the number from the Kafka topic, and a final bean exposes the number as a REST UI (using Server Sent events).</p>\n</div>\n<div>\n<div>Prerequisites</div>\n<ul>\n<li>\n<p>You have configured the Quarkus example application to connect to the Kafka instance.</p>\n</li>\n<li>\n<p>You have created the <code>prices</code> example Kafka topic.</p>\n</li>\n</ul>\n</div>\n<div>\n<div>Procedure</div>\n<ol>\n<li>\n<p>On the command line, navigate to the <code>guides/quarkus</code> directory that you imported and enter the following commands to run the Quarkus example application.</p>\n<div>\n<div>Running the Quarkus example application</div>\n<div>\n<pre><code>$ cd ~/guides/quarkus\n$ ./mvnw quarkus:dev</code></pre>\n</div>\n</div>\n</li>\n<li>\n<p>After the application is running, in a web browser, go to <a href=\"http://localhost:8080/prices.html\">http://localhost:8080/prices.html</a> and verify that the <code>Last price</code> is updated.</p>\n<div>\n<p>If the Quarkus application fails to run, review the error log in the terminal and address any problems. Also review the steps in this quick start to ensure that the Quarkus application and Kafka topic are configured correctly.</p>\n</div>\n</li>\n</ol>\n</div>\n<div>\n<div>Verification</div>\n<ul>\n<li>\n<p>Did the Quarkus example application run without any errors?</p>\n</li>\n<li>\n<p>At <a href=\"http://localhost:8080/prices.html\">http://localhost:8080/prices.html</a>, is the <code>Last price</code> updated?</p>\n</li>\n</ul>\n</div>\n<div id=\"user-content-conclusion\">\n<p>Congratulations! You successfully completed the {product} Quarkus quick start, and are now ready to use your own Quarkus applications with {product}.</p>\n</div>"
      }
    ],
    "conclusion": "<p>Congratulations! You successfully completed the {product} Quarkus quick start, and are now ready to use your own Quarkus applications with {product}.</p>"
  }
}